/*
  自我介绍一下：大家好，我是小手冰凉，不要喊我人妖，谢谢！



  有人只认识乔布斯，却很少有人认识丹尼斯里奇（C语言之父）。害，不谈了，都是泪啊。



  本人写代码用的是VS2022哈，可能有的学校再用dev c++;vc 6.0等等哈（额，能少用尽量不用我提到的这俩，太老太旧了）。
  vs2022啊，vs2019啊是集合开发环境（通俗讲你要制造飞机，我零件都给你配好了，你现在只用组装一下了，而不是你要一个一个造，明白吗家人？）
  还是比较适合小白的。另外确实vs比较流行，企业使用率比较高。



  多的也不说了，就是所占储存有点大（大是有原因的，你可以理解为功能强大），7，8G；一个几kb的照片和一个几百kb的照片你可以比一下就知道啦



  我这样结尾是不是有点草率？额先讲讲C的理论知识吧（了解一下，预热）。下节课敲代码！！！



  学习语言如果可以自己选择，一定要从C开始奥。毕竟C是面对过程的语言（面对过程就是从上到下依次执行，一点一点来呗，你总不能一口气吃个胖子吧？）
  其实你记住C语言从上往下依次执行！！！你已经学好一半了。（Frank暴躁大叔说的，我感觉很有道理，哈哈）



  预热：
       人和人交流张嘴说话（自然语言），计算机语言是二进制语言（0和1）。
       人为了计算机可以提高自己的工作效率，一开始呢，告诉计算机意图都要用0和1一大串来表示，太烧脑了
       用ADD（01010010101瞎打的）表示加法吧等等，我们称ADD为助记符，(汇编语言)
       还是太麻烦……………………后来C语言（是不是太草率了，抱歉）
       刚开始C不太成熟，你写的代码在我这跑不过去，我写的在你那跑不过去，咋？三分天下？后来就有了国际标准，明白吧？
       谁不是国际标准？国际？世界通用；标准？（你告诉我你语文多少分？）





   今天就讲到这，谢谢大家！






  */